RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_crypto.c
cy_en_crypto_status_t Cy_Crypto_Init(cy_stc_crypto_config_t const *config,
                                     cy_stc_crypto_context_t *context)
{
    cy_en_crypto_status_t status = CY_CRYPTO_SERVER_NOT_STARTED;

    CY_ASSERT(NULL != config);
    CY_ASSERT(NULL != context);

    context->ipcChannel = config->ipcChannel;
    context->acquireNotifierChannel = config->acquireNotifierChannel;
    context->releaseNotifierChannel = config->releaseNotifierChannel;
    context->userCompleteCallback   = config->userCompleteCallback;
    context->releaseNotifierConfig.intrSrc = config->releaseNotifierConfig.intrSrc;

    /* Release the Crypto IPC channel with the Release interrupt */
    (void)Cy_IPC_Drv_LockRelease(Cy_IPC_Drv_GetIpcBaseAddress(context->ipcChannel), CY_IPC_NO_NOTIFICATION);

    context->instr = CY_CRYPTO_INSTR_ENABLE;

    /* Check whether the Crypto server started (Crypto IPC Notify interrupt is started) */
    if (Cy_Crypto_IsServerStarted(context))
    {
        /* Sets up a Release interrupt if the customer wants */
        if (NULL != context->userCompleteCallback)
        {
            (void)Cy_SysInt_Init(&config->releaseNotifierConfig, &Cy_Crypto_Client_ReleaseIntrHndlr);

            /* Sets up the IPC Release interrupt here */
            Cy_IPC_Drv_SetInterruptMask(Cy_IPC_Drv_GetIntrBaseAddr(context->releaseNotifierChannel),
                                                            (1uL << context->ipcChannel), CY_IPC_NO_NOTIFICATION);

            NVIC_EnableIRQ(context->releaseNotifierConfig.intrSrc);
        }

        clientContext = context;

        status = CY_CRYPTO_SUCCESS;
    }

    return (status);
}

cy_en_crypto_status_t Cy_Crypto_DeInit(void)
{
    uint32_t interruptMasked;
    cy_en_crypto_status_t err = CY_CRYPTO_SUCCESS;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_UNKNOWN;

        /* If the release interrupt was enabled, disable it here */
        if (NULL != clientContext->userCompleteCallback)
        {
            /* Disable the Release interrupt from IPC */
            NVIC_DisableIRQ(clientContext->releaseNotifierConfig.intrSrc);

            /* Re-set up the IPC Release interrupt here */
            interruptMasked = Cy_IPC_Drv_ExtractReleaseMask(Cy_IPC_Drv_GetInterruptStatusMasked(Cy_IPC_Drv_GetIntrBaseAddr(clientContext->releaseNotifierChannel)));

            /* Check that there really is the IPC Crypto Release interrupt */
            if ((1uL << clientContext->ipcChannel) == interruptMasked)
            {
                Cy_IPC_Drv_ClearInterrupt(Cy_IPC_Drv_GetIntrBaseAddr(clientContext->releaseNotifierChannel), interruptMasked, CY_IPC_NO_NOTIFICATION);
            }
        }

        clientContext = NULL;
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Enable(void)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_ENABLE;
        clientContext->xdata = NULL;

        err = Cy_Crypto_Client_Send();

        /* Wait until initialization completes */
        if (CY_CRYPTO_SUCCESS == err)
        {
            err = Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
        }
    }
    return (err);
}

/*******************************************************************************
* Function Name: Cy_Crypto_GetLibraryInfo
****************************************************************************//**
*
* This function gets information about Crypto library.
*
* \param cryptoInfo
* The pointer to a variable to store gathered crypto library information.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_GetLibraryInfo(cy_en_crypto_lib_info_t *cryptoInfo)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_SRV_INFO;
        clientContext->xdata = (void *)cryptoInfo;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Disable(void)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_DISABLE;
        clientContext->xdata = NULL;

        err = Cy_Crypto_Client_Send();

        /* Wait until initialization completes */
        if (CY_CRYPTO_SUCCESS == err)
        {
            err = Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
        }
    }
   return (err);
}

#if (CPUSS_CRYPTO_PR == 1)
cy_en_crypto_status_t Cy_Crypto_Prng_Init(uint32_t lfsr32InitState,
                                          uint32_t lfsr31InitState,
                                          uint32_t lfsr29InitState,
                                          cy_stc_crypto_context_prng_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_PRNG_INIT;
        clientContext->xdata = (void *)cfContext;

        cfContext->lfsr32InitState = lfsr32InitState;
        cfContext->lfsr31InitState = lfsr31InitState;
        cfContext->lfsr29InitState = lfsr29InitState;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_Prng_Generate(uint32_t max,
                                              uint32_t *randomNum,
                                              cy_stc_crypto_context_prng_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_PRNG;
        clientContext->xdata = (void *)cfContext;

        cfContext->max = max;
        cfContext->prngNum = randomNum;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* #if (CPUSS_CRYPTO_PR == 1) */

#if (CPUSS_CRYPTO_AES == 1)
cy_en_crypto_status_t Cy_Crypto_Aes_Init(uint32_t *key,
                                         cy_en_crypto_aes_key_length_t keyLength,
                                         cy_stc_crypto_context_aes_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_AES_INIT;
        clientContext->xdata = cfContext;

        cfContext->key = key;
        cfContext->keyLength = keyLength;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

