RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_crypto.c
        cfContext->verResult = verResult;
        cfContext->digestType = digestType;
        cfContext->hash = digest;
        cfContext->decryptedSignature = decryptedSignature;
        cfContext->decryptedSignatureLength = decryptedSignatureLength;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}
#endif /* #if (CPUSS_CRYPTO_SHA == 1) */

cy_en_crypto_status_t Cy_Crypto_ECDSA_SignHash(const uint8_t *hash,
                                        uint32_t hashlen,
                                        uint8_t *sig,
                                        const cy_stc_crypto_ecc_key *key,
                                        const uint8_t *messageKey,
                                        cy_stc_crypto_context_ecc_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_ECDSA_SIGN;
        clientContext->xdata = cfContext;

        cfContext->datalen = hashlen;
        cfContext->src0 = hash;
        cfContext->dst0 = sig;
        cfContext->key  = key;
        cfContext->src1 = messageKey;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_ECDSA_VerifyHash(const uint8_t *sig,
                                        const uint8_t *hash,
                                        uint32_t hashlen,
                                        uint8_t *stat,
                                        const cy_stc_crypto_ecc_key *key,
                                        cy_stc_crypto_context_ecc_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_ECDSA_VER;
        clientContext->xdata = cfContext;

        cfContext->datalen = hashlen;
        cfContext->src0 = hash;
        cfContext->src1 = sig;
        cfContext->dst0 = stat;
        cfContext->key  = key;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

#endif /* #if (CPUSS_CRYPTO_VU == 1) */

cy_en_crypto_status_t Cy_Crypto_SetMemBufAddress(uint32_t const *newMembufAddress,
                                           uint32_t newMembufSize,
                                           cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEMBUF_SET;
        clientContext->xdata = cfContext;

        cfContext->src0 = newMembufAddress;
        cfContext->dataSize = newMembufSize;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_GetMemBufAddress(uint32_t **membufAddress,
                                           cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEMBUF_ADDR;
        clientContext->xdata = cfContext;

        cfContext->dst = (void *)membufAddress;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

cy_en_crypto_status_t Cy_Crypto_GetMemBufSize(uint32_t *membufSize,
                                           cy_stc_crypto_context_str_t *cfContext)
{
    cy_en_crypto_status_t err = CY_CRYPTO_NOT_INITIALIZED;

    if (clientContext != NULL)
    {
        clientContext->instr = CY_CRYPTO_INSTR_MEMBUF_SIZE;
        clientContext->xdata = cfContext;

        cfContext->dst = (void *)membufSize;

        err = Cy_Crypto_Client_Send();
    }
    return (err);
}

void Cy_Crypto_InvertEndianness(void *inArrPtr, uint32_t byteSize)
{
    int32_t limit;
    int32_t i;
    int32_t j = 0;
    uint8_t temp;
    uint8_t *tempPtr = (uint8_t*)inArrPtr;

    if (byteSize > 1u)
    {
        limit = (int32_t)byteSize / 2;
        if (0u == (byteSize % 2u))
        {
            --limit;
        }

        j = 0;
        i = (int32_t)byteSize - 1;
        while ( i > limit)
        {
            temp = tempPtr[j];
            tempPtr[j] = tempPtr[i];
            tempPtr[i] = temp;

            --i;
            ++j;
        }
    }
}


#if defined(__cplusplus)
}
#endif


#endif /* CY_IP_MXCRYPTO */


/* [] END OF FILE */
